#!/usr/bin/env python
# -*- coding: utf-8 -*-
########################################################################
# 
# Copyright (c) 2017 Qianbao.com, Inc. All Rights Reserved
# 
########################################################################
 
"""
File: check_num.py
Author: wangqj(wangqj@qianbao.com)
Date: 2017/03/17 17:56:02
"""

import re


txt = """
1:  
最高人民法院(848)
2:  
北京市(59268)
3:  
天津市(78083)
4:  
河北省(184364)
5:  
山西省(86353)
6:  
内蒙古自治区(81458)
7:  
辽宁省(118717)
8:  
吉林省(141782)
9:  
黑龙江省(101865)
10: 
上海市(106293)
11: 
江苏省(281222)
12: 
浙江省(467931)
13: 
安徽省(188295)
14: 
福建省(185003)
15: 
江西省(74019)
16: 
山东省(285652)
17: 
河南省(249098)
18: 
湖北省(148744)
19: 
湖南省(200209)
20: 
广东省(368792)
21: 
广西壮族自治区(163381)
22: 
海南省(27357)
23: 
重庆市(116779)
24: 
四川省(220779)
25: 
贵州省(111969)
26: 
云南省(184714)
27: 
西藏自治区(5611)
28: 
陕西省(120870)
29: 
甘肃省(75205)
30: 
青海省(24541)
31: 
宁夏回族自治区(25883)
32: 
新疆维吾尔自治区(34294)
33: 
新疆维吾尔自治区高级人民法院生产建设兵团分院(24952)
"""

pat = re.compile(r'.*\((\d+)\)')
lines = txt.splitlines()
num = 0
for line in lines:
    match = pat.search(line)
    if match:
        print match.group(1)
        num += int(match.group(1))
print 'sum', num


